"""

3. ให้รับเวลาเข้าและออกของรถให้รับเวลาเข้าและออกของรถคันหนึ่ง (เปิดบริการตั้งแต่ 7:00 - 23:00) จากนั้น
คํานวณค่าที่จอดรถที่ต้องจ่าย โดยหลักเกณฑ์การคํานวณมีดังนี้
    1) จอดรถไม่เกิน 15 นาทีไม่คิดค่าบริการ
    2) จอดรถเกิน 15 นาทีแต่ไม่เกิน 4 ชั่วโมง คิดค่าบริการชั่วโมงละ 10 บาท เศษของชั่วโมงคิดเป็นหนึ่งชั่วโมง
    3) จอดรถตั้งแต่ 4 ชั่วโมง ถึง 6 ชั่วโมง คิดค่าบริการชั่วโมงที่ 4-6 ชั่วโมงละ 20 บาท เศษของชั่วโมงคิดเป็นหนึ่งชั่วโมง
    4) จอดรถเกิน 6 ชั่วโมงขึ้นไป เหมาจ่ายวันละ 200 บาท
    
    ข้อมูลนําเข้า มี1 บรรทัด แต่ละบรรทัดมีจํานวนเต็ม 4 จํานวนคั่นด้วย Spaceโดยบรรทัดที่ 1-2 เป็นชั่วโมงและนาทีของเวลาเข้า และบรรทัดที่ 3-4 เป็นชั่วโมงและนาทีของเวลาออก
    
ข้อมูลส่งออกมีบรรทัดเดียว เป็นค่าที่จอดรถที่ต้องจ่าย ให้แสดงผลลัพธ์เป็นจํานวนเต็ม

Input               Output

7 0 7 15            0
7 0 7 16            10
7 30 10 30          30
7 30 10 31          50
7 30 13 31          200

"""

import math
total_min = 0
cost = 0
hr_in, min_in, hr_out, min_out = [int(i) for i in str(input("hr_in, min_in, hr_out, min_out : ")).split()]

total_min = ((hr_out * 60) + min_out) - ((hr_in * 60) + min_in)
total_hr = math.ceil(total_min/60)

# print("Time Min : ", total_min)
# print("Time hr : ", total_hr)

if((hr_in*60 + min_in < 7*60) or (hr_out*60 + min_out > 23*60) or (hr_out*60 + min_out < hr_in*60 + min_in)):
    print("Error")
else:
    if(total_min <= 15):
        cost = 0
    elif(total_min <= 3*60):
        cost = total_hr*10
    elif(total_min <= 6*60):
        cost = (3*10) + ((total_hr-3) * 20)
    else:
        cost = 200
    print(cost)